package ru.luxkod;


//Система Управления Зоопарком: Обзор
//
//        Цель: Разработка системы управления для зоопарка, учитывая животных, работников, и посетителей.
//        1. Животные:
//
//        Атрибуты: имя, вид (например, лев, тигр, слон) и пища.
//        Методы: кормление.
//
//        2. Работники:
//
//        Атрибуты: имя и роль (например, кормильщик, ветеринар).
//        Методы: выполнение обязанностей (например, кормление животных).
//
//        3. Посетители:
//
//        Атрибуты: имя и тип билета.
//        Методы: посещение зоопарка.
//
//        4. Зоопарк:
//
//        Содержит списки животных, работников и посетителей.
//        Методы для добавления животных, работников и посетителей.
//
//        Основные действия:
//
//        Кормление животных (только кормильщиками).
//        Посещение зоопарка посетителями.

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}